/*1. ѕерва€ задача интересна€ и достаточно проста€. Ќо код получитс€ длинным. 
Ёту задачу придумали наши преподаватели из компьютерной академии. 
»де€ была така€ Ц как бы заставить начинающих студентов  помучитьс€ с написанием кода, 
чтобы писанины было побольше )))  
«адание: ѕользователь вводит число от 1 до 9999 (сумму выдачи в банкомате). 
Ќеобходимо вывести на экран словами введенную сумму и в конце написать название валюты с правильным окончанием. 
Ќапример: 7431 Ц семь тыс€ч четыреста тридцать один доллар, 2149 Ц две тыс€чи сто сорок дев€ть долларов, 
15 Ц п€тнадцать долларов, 3 Ц три доллара. 
ƒл€ решени€ этой задачи вам необходимо будет примен€ть оператор % (остаток от делени€).*/
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	int a, b, c, d;
	int in = 0;

	cout << "ѕожаллуйста, введите сумму дл€ сн€ти€ денег из банкомата (она может варьироватьс€ от 1 до 9999 долларов)" << endl;
	cin >> in;
	if (in <= 0 || in > 9999)
		cout << "ћолодец, ты сломал программу" << endl;
	else
	{
		cout << "¬ами получено: " << endl << endl;
		a = in / 1000 % 10;
		if (a == 1)
			cout << "ќдна тыс€ча ";
		else if (a == 2)
			cout << "ƒве тыс€чи ";
		else if (a == 3)
			cout << "“ри тыс€чи ";
		else if (a == 4)
			cout << "„етыре тыс€чи ";
		else if (a == 5)
			cout << "ѕ€ть тыс€ч ";
		else if (a == 6)
			cout << "Ўесть тыс€ч ";
		else if (a == 7)
			cout << "—емь тыс€ч ";
		else if (a == 8)
			cout << "¬осемь тыс€ч ";
		else if (a == 9)
			cout << "ƒев€ть тыс€ч ";
		else if (a == 0)
			cout << ' ';

		b = in / 100 % 10;
		if (b == 1)
			cout << "сто ";
		else if (b == 2)
			cout << "двести ";
		else if (b == 3)
			cout << "триста ";
		else if (b == 4)
			cout << "четыреста ";
		else if (b == 5)
			cout << "п€тьсот ";
		else if (b == 6)
			cout << "шестьсот ";
		else if (b == 7)
			cout << "семьсот ";
		else if (b == 8)
			cout << "восемсот ";
		else if (b == 9)
			cout << "дев€тьсот ";
		else if (b == 0)
			cout << ' ';

		c = in / 10 % 10;
		if (c == 1)
		{
			d = in % 10;
			if (d == 1)
				cout << "одиннадцать доларов.";
			else if (d == 2)
				cout << "двенадцать доларов";
			else if (d == 3)
				cout << "тринадцать доларов";
			else if (d == 4)
				cout << "четырнадцать доларов";
			else if (d == 5)
				cout << "п€тнадцать доларов";
			else if (d == 6)
				cout << "шестнадцать доларов";
			else if (d == 7)
				cout << "семнадцать доларов";
			else if (d == 8)
				cout << "восемнадцать доларов";
			else if (d == 9)
				cout << "дев€тнадцать доларов";
			else if (d == 0)
				cout << "десе€ть доларов";
		}

		if (in / 10 % 10 == 2)
			cout << "двадцать ";
		else if (in / 10 % 10 == 3)
			cout << "тридцать ";
		else if (in / 10 % 10 == 4)
			cout << "сорок ";
		else if (in / 10 % 10 == 5)
			cout << "п€тьдес€ть ";
		else if (in / 10 % 10 == 6)
			cout << "шестьдес€ть ";
		else if (in / 10 % 10 == 7)
			cout << "семьдес€т ";
		else if (in / 10 % 10 == 8)
			cout << "восемьдес€т ";
		else if (in / 10 % 10 == 9)
			cout << "дев€носто ";
		else if (in / 10 % 10 == 0)
			cout << ' ';

		if (c != 1)
		{
			d = in % 10;
			if (d == 1)
				cout << "один долар.";
			else if (d == 2)
				cout << "два долара";
			else if (d == 3)
				cout << "три долара";
			else if (d == 4)
				cout << "четыре долара";
			else if (d == 5)
				cout << "п€ть доларов";
			else if (d == 6)
				cout << "шесть доларов";
			else if (d == 7)
				cout << "семь доларов";
			else if (d == 8)
				cout << "восемь доларов";
			else if (d == 9)
				cout << "дев€ть доларов";
			else if (d == 0)
				cout << "доларов";
		}
	}
	cout << endl;
		system("pause");
		return (0);
}